[
  {
    "place": "Madani Berkelanjutan",
    "status": "Internship",
    "type": "Hybrid",
    "period": "08/2024 - 01/2025",
    "location": "South Jakarta, DKI Jakarta",
    "role": "Full Stack Web Developer",
    "description": null,
    "achievements": [
      "Reduced code complexity and improved maintainability, resulting in fewer bugs and faster development of new features, by migrating the website from Laravel to React.js and implementing a modular architecture.",
      "Improved website performance scores from 49% to 84% (Lighthouse Insights) by implementing lazy loading, image compression, and code optimization techniques.",
      "Ensured smooth communication between front-end and back-end systems, eliminating communication errors and speeding up response times, by developing and implementing a RESTful API using Node.js (Express) and MySQL.",
      "Automating previously manual HR processes, significantly saving time and reducing human error, by building a web-based Human Resource Information System (HRIS) application."
    ],
    "tech_stack": [
      "HTML",
      "CSS",
      "JavaScript",
      "React.js",
      "Node.js",
      "Express.js",
      "Tailwind CSS",
      "MySQL",
      "REST API"
    ]
  },
  {
    "place": "LSP Geospasial",
    "status": "Freelance",
    "type": "Remote",
    "period": "04/2024 - 05/2024",
    "location": "Bekasi, West Java",
    "role": "Front End Web Developer",
    "description": null,
    "achievements": [
      "Achieved smooth API integration, demonstrated through efficient data flow and minimal errors, by partnering with the backend developer to grasp the API structure, tailor data needs, and resolve potential integration challenges.",
      "Accelerate the collection of assessment data for assessors by increasing efficiency and ease of process through the development of initial assessment applications."
    ],
    "tech_stack": [
      "HTML",
      "CSS",
      "JavaScript",
      "Tailwind CSS",
      "React JS",
      "REST API"
    ]
  }
]
